{"searchQuery":"Biblical Prophecy and End Times News","results":[{"title":"Prophecy Fulfilled? Chuck Pierce’s Astonishing Warning to Iran","commentaries":null,"alignment":7,"summary":"This article reports on Chuck Pierce's prophetic warning to Iran in November 2024, suggesting its fulfillment through events like Operation Rising Lion. Pierce stated, \"I say to Iran today, in the next ten months, get ready, for I will send wind after wind to you, to change you.\" The article interprets Israel's actions as a divinely backed repositioning. Readers should verify such claims against scripture, ensuring alignment with biblical prophecies.","images":["https://mycharisma.com/wp-content/uploads/2025/07/war-planes_Tehran.png"],"href":"https://mycharisma.com/propheticrevival/prophecy-fulfilled-chuck-pierces-astonishing-warning-to-iran/","tags":["prophecy","Israel","Iran","KJV","news"],"politicalBiases":[]},{"title":"Why God Is Not Finished With Israel: A Biblical Warning","commentaries":null,"alignment":10,"summary":"Jack Hibbs and Amir Tsarfati confront replacement theology, warning it contradicts Scripture and undermines God's promises. Hibbs states, \"Replacement theology says that God is finished with the Jew... It is heresy.\" Tsarfati adds many churches now believe God is done with Israel, stemming from a lack of understanding of God’s unconditional covenants. They reinforce God's covenant with Israel from Genesis to the New Testament, emphasizing Romans 11 where Paul clarifies God has not rejected His people.","images":["https://mycharisma.com/wp-content/uploads/2025/07/City-of-Jerusalem.png"],"href":"https://mycharisma.com/propheticrevival/why-god-is-not-finished-with-israel-a-biblical-warning-from-jack-hibbs-and-amir-tsarfati/","tags":["Israel","theology","scripture","prophecy"],"politicalBiases":[]},{"title":"Are MAGA Christians Turning on Israel Over West Bank Church Attack?","commentaries":null,"alignment":6,"summary":"The article discusses a potential shift in support for Israel among MAGA Christians due to a settler attack on a West Bank church. Mike Huckabee, a prominent Christian Zionist, condemned the attack, highlighting a tension between unconditional support for Israel and the treatment of Palestinian Christians. Quotes: \"Desecrating a church, mosque or synagogue is a crime against humanity and God,\" Huckabee stated. The article suggests that figures like Huckabee are increasingly forced to reconcile their theology with the consequences of unconditional support for Israel, potentially signaling a moral pause or shift in the MAGA base. This aligns with scripture as God is not the author of confusion. (1 Corinthians 14:33)","images":[],"href":"https://www.newarab.com/news/maga-turning-israel-over-west-bank-church-attack","tags":["Christian Zionism","Israel","West Bank","faith","politics"],"politicalBiases":["pro-Palestinian","anti-Zionist"]},{"title":"Rheinmetall’s Infiltration of Britain","commentaries":null,"alignment":8,"summary":"Josué Michels, writing for the Trumpet, warns about Rheinmetall's growing influence in the UK's defense industry, highlighting its historical ties to Germany and potential risks to British autonomy. The article quotes Gerald Flurry on Germany's resurgence and references Bible prophecy, specifically Isaiah 10 and Hosea 5, to suggest an impending betrayal of Britain by Germany. It urges readers to consider the implications for national security, drawing parallels with historical events and biblical warnings. \"In an end-time prophecy in Isaiah 10, God calls the Assyrians—modern Germany—His corrective rod to punish the modern nations of Israel, including Britain.\"","images":["https://www.thetrumpet.com/files/W1siZiIsIjIwMjUvMDcvMjEvNTdqaTNwdTZ6Y18yMDI1MDcyMV9Ccml0YWluX3JoZWlubWV0YWxsX0dldHR5SW1hZ2VzXzIyMTc4Mzg2NzEuanBnIl0sWyJwIiwidGh1bWIiLCIyMDQ4eDIwNDg-Il0sWyJwIiwiZW5jb2RlIiwianBnIiwiLXF1YWxpdHkgODAiXV0/b5ae34e2791b585c/20250721-Britain%20rheinmetall-GettyImages-2217838671.jpg.jpg"],"href":"https://www.thetrumpet.com/31929-rheinmetalls-infiltration-of-britain","tags":["prophecy","national security","deception","Germany","Britain","Isaiah","Hosea"],"politicalBiases":["conservative","religious","pro-Western"]},{"title":"Coldplay, Simpsons, AI and an Affair: Was This Prophesied?","commentaries":null,"alignment":8,"summary":"Article discusses a viral AI-generated meme depicting a scene from 'The Simpsons' that seemed to predict an affair involving former Astronomer CEO Andy Byron. It warns believers to practice discernment with media and purported prophecies, urging them to \"test everything; hold fast what is good\" (1 Thessalonians 5:21). True prophecy aligns with God's Word and brings clarity.","images":["https://mycharisma.com/wp-content/uploads/2025/07/Simpsons_Kiss-Cam-1.png"],"href":"https://mycharisma.com/culture/coldplay-simpsons-ai-and-an-affair-was-this-prophesied/","tags":["discernment","prophecy","AI","deception","scripture"],"politicalBiases":[]}],"title":"Prophecy Fulfilled? Chuck Pierce’s Astonishing Warning to Iran","date":"2025-07-22T07:25:30-04:00"}