{"searchQuery":"Economy and Energy News in Trinidad and Tobago","results":[{"title":"68 of 94 BIR Vacancies Filled","commentaries":null,"alignment":1,"summary":"Minister Swaratsingh reports 68 of 94 vacancies in the Board of Inland Revenue (BIR) have been accepted, aiming to bridge recruitment gaps with the DPA's help. The focus is on private sector-led diversification, engaging foreign agencies and supporting SMEs, with calls for supermarkets to allocate more space to local products. The Scale Up TT program has supported companies, generating significant income and jobs. \"One of the major complaints that we would have heard from persons is they’ve been trying to get on the shelves of these larger establishments, and they can’t.\"","images":["https://bloximages.newyork1.vip.townnews.com/trinidadexpress.com/content/tncms/assets/v3/editorial/8/4a/84abbb54-f67e-11ee-99a2-537c5b195423/66d0a1612569b.image.png","https://bloximages.newyork1.vip.townnews.com/trinidadexpress.com/content/tncms/assets/v3/editorial/3/26/32645139-64db-4b23-b787-bde75833af36/681b772cc226c.image.png"],"href":"https://trinidadexpress.com/business/local/68-of-94-bir-vacancies-filled/article_a44e507c-8b82-4c1e-877d-f09ca85917f7.html","tags":["economy","business","local products"],"politicalBiases":[]},{"title":"Swaratsingh: More Support for SMEs Needed From Large Companies","commentaries":null,"alignment":5,"summary":"Kennedy Swaratsingh, Minister of Planning, Economic Affairs and Development, advocates for increased support of local MSMEs by large companies like Massy and Xtra Foods. He suggests creating dedicated spaces for local products, drawing inspiration from other Caribbean countries. This aligns with supporting local producers and fostering economic growth. While the article focuses on economic strategies, the principle of supporting one's community resonates with biblical concepts of charity and stewardship (Galatians 6:10).","images":["https://newsday.co.tt/wp-content/uploads/2025/07/24273086-1024x684.jpg"],"href":"https://newsday.co.tt/2025/07/25/swaratsingh-more-support-for-smes-needed-from-large-companies/","tags":["economy","community","stewardship"],"politicalBiases":[]}],"title":"68 of 94 BIR Vacancies Filled","date":"2025-07-26T15:27:28-04:00"}