{"searchQuery":"Faith and Ethics in the Digital Age","results":[{"title":"PM: Muslim World Must Defend Islamic Intellectual Tradition Amid Modern Threats","commentaries":null,"alignment":8,"summary":"Anwar Ibrahim urges Muslims to uphold Islamic traditions and ensure technological progress, especially in AI, is guided by faith and ethics. Speaking at Malaysia Bermunajat 2025, he stressed unity between religious scholars and leaders to face modern challenges. He highlights the importance of integrating traditional Islamic education into the national framework, enabling students to master the digital world while maintaining their Islamic roots. This stance aligns with the axioms of acknowledging God's guidance in all advancements and valuing spiritual grounding as mentioned in scripture. Remember to view the full article with spiritual discernment.","images":["https://media.thevibes.com/images/uploads/covers/_large/Anwar_Islam_july_20.jpg"],"href":"https://www.thevibes.com/articles/news/110701/pm-muslim-world-must-defend-islamic-intellectual-tradition-amid-modern-threats","tags":["faith","ethics","technology","Islamic values","scripture"],"politicalBiases":["pro-government","conservative"]},{"title":"Anwar: Islamic Values Key to Navigating AI, Digital Age","commentaries":null,"alignment":7,"summary":"Prime Minister Anwar Ibrahim emphasizes the importance of Islamic values in the age of AI and digital innovation, stating that these technologies should not stray from faith and ethics. He urges pondok schools to master modern advancements while preserving Islamic knowledge. He warns that without values and morality, AI will be a product of Western influence. Remember, this is simply a summary, refer to the original source and proceed with spiritual discernment.","images":["https://assets.nst.com.my/images/articles/DATUK_SERI_ANWAR_IBRAHIM_c8918192809e4930907456e05c03a861_1752939004.jpg"],"href":"https://www.nst.com.my/news/nation/2025/07/1247300/updated-anwar-islamic-values-key-navigating-ai-digital-age","tags":["faith","technology","ethics","Islamic Values","scripture"],"politicalBiases":["Government Policy","Islamic"]}],"title":"PM: Muslim World Must Defend Islamic Intellectual Tradition Amid Modern Threats","date":"2025-07-19T20:42:24-04:00"}