{"searchQuery":"Faith, Freedom, and Religious News in the USA","results":[{"title":"Preaching in Public Transport: Law, Faith and Freedom","commentaries":null,"alignment":7,"summary":"An article discussing the debate around preaching in public transport in Ghana, examining legal perspectives, Christian doctrine, and global practices. It highlights the constitutional guarantee of religious freedom while noting legal restrictions against causing nuisance in public transport. The article quotes Mark 16:15 regarding evangelism and 1 Peter 3:15 about gentleness and respect, suggesting a balance between zeal and wisdom. It concludes by proposing solutions such as designated preaching spaces or revised policies for non-disruptive religious expression.","images":["https://cdn.modernghana.com/story-/926/499/7262025114237-ptkwuigtto-preacher-in-trotro-ghana-product-5e3c03673e7701090.jpeg","https://cdn.modernghana.com/content__/84/56/726202570340-wbreuihtto-ghana-police.jpg"],"href":"https://www.modernghana.com/news/1419619/preaching-in-public-transport-law-faith-and-free.html","tags":["freedom","law","gospel","Ghana"],"politicalBiases":[]},{"title":"Bangladesh Religious Freedom Still a Concern Despite Reforms: USCIRF","commentaries":null,"alignment":6,"summary":"A report by USCIRF highlights ongoing concerns about religious freedom in Bangladesh despite recent reforms. While the interim government has made progress, religious minorities feel increasingly vulnerable due to vaguely worded laws like Section 195A of the Penal Code and provisions in the Cyber Security Act, which are used to silence dissent under the guise of \"hurting religious sentiments.\" The report also notes rising religious influence on campuses and a lack of accountability for attacks on religious minorities. As KJV reminds us in 2 Timothy 3:12, \"Yea, and all that will live godly in Christ Jesus shall suffer persecution.\"","images":["https://cdn.jagonews24.com/media/imgAllNew/BG/2023March/unit-20250726161744-20250726165645.jpg"],"href":"https://www.jagonews24.com/en/national/news/84360","tags":["religious freedom","persecution","Bangladesh","political reform"],"politicalBiases":[]},{"title":"Religious Minorities Facing Discrimination in Bangladesh: US Report","commentaries":null,"alignment":8,"summary":"A USCIRF report highlights ongoing discrimination against religious minorities in Bangladesh, including Hindus, indigenous groups, Ahmadiyyas, and Sufi Muslims. The report raises concerns about blasphemy laws and the Cyber Security Act, which create an atmosphere of fear and censorship. While commitments to protect religious freedom have been voiced, many citizens still fear for their safety and ability to practice their faith freely. The KJV Bible teaches in Galatians 3:28, 'There is neither Jew nor Greek, there is neither bond nor free, there is neither male nor female: for ye are all one in Christ Jesus,' condemning such discrimination.","images":["https://thereport.live/media/imgAll/2024November/US-Concern-02-20250726114925.jpg"],"href":"https://thereport.live/bangladesh/religious-minorities-facing-discrimination-in-bangladesh-us-report/36663","tags":["religious freedom","discrimination","persecution","minorities","KJV Bible"],"politicalBiases":["US government report"]},{"title":"Keeping Fun Rooted in Gratitude and Moderation: A Cup Match Reflection","commentaries":null,"alignment":5,"summary":"Linda Walia Ming reflects on the Cup Match holiday in Bermuda, emphasizing gratitude, moderation, and unity in community. The article touches on Emancipation Day, Islamic teachings, and secular values, promoting joy with purpose and remembrance of freedom. It quotes Koran 7:32 and a Hadith from Sahih Muslim, urging prayer for the less fortunate and unity against wars. While promoting some values aligned with biblical principles, the article's reliance on the Koran introduces theological contradictions, as the KJV Bible is the sole authority. Readers should approach with discernment.","images":[],"href":"https://www.royalgazette.com/religion/lifestyle/article/20250726/keeping-fun-rooted-in-gratitude-and-moderation/","tags":["community","gratitude","moderation","islam","unity","KJV Bible"],"politicalBiases":[]}],"title":"Preaching in Public Transport: Law, Faith and Freedom","date":"2025-07-26T15:29:44-04:00"}