{"searchQuery":"Faith, Freedom, and Religious News in the USA","results":[{"title":"Islam Guides Us, But It Doesn’t Chain Us: Somaliland's Minister of Religious Affairs","commentaries":null,"alignment":3,"summary":"An interview with Somaliland's Minister of Religious Affairs, Sheikh Abdullahi Dahir Jama, discusses the role of Islam in Somaliland's society and governance. He states that while Islam is the guiding principle, it does not infringe on personal freedom of belief, though proselytizing of other religions is not allowed. The Minister emphasizes community intelligence and moderate religious education to counter extremism, noting that radical ideology is a distortion of Islam. Praising Pakistan's Raiwind Ijtema for promoting peace, he underscores Somaliland's self-reliance in religious affairs and invites international collaboration for educational and technological advancement. The Minister's views on Islam may conflict with the Bible's teaching on religious freedom and the exclusivity of salvation through Jesus Christ (John 14:6; Acts 4:12).","images":["https://www.stvincenttimes.com/wp-content/uploads/2025/07/WhatsApp-Image-2025-07-03-at-19.12.50_5715d6a0.jpg"],"href":"https://www.stvincenttimes.com/islam-guides-us-but-it-doesnt-chain-us/","tags":["islam","politics","religious freedom","Somalia","deception"],"politicalBiases":["Islamic","Somaliland Government"]},{"title":"Ukraine Issues Ultimatum to Russian Orthodox Church","commentaries":null,"alignment":7,"summary":"Ukraine has ordered the pro-Russian UOC to sever ties with the Moscow Patriarchate by August 18, threatening dissolution for violating religious freedom laws due to its affiliation with the Russian Church. The UOC, led by Metropolitan Onufryj, faces potential termination of activities and loss of property rights. While Onufryj has condemned Moscow's aggression, he hasn't formally declared independence, and some clergy still support Russia. This situation reflects the ongoing tensions between the two souls of Orthodoxy, with Patriarch Kirill protesting against “violations of religious freedom” in Ukraine. KJV reminds us in Matthew 10:22, 'And ye shall be hated of all men for my name's sake: but he that endureth to the end shall be saved.'","images":["https://www.asianews.it/files/img//Onuphrius_of_Kyiv.jpg"],"href":"https://www.asianews.it/news-en/Ukraine's-ultimatum-to-Russian-Orthodox-Christians-63544.html","tags":["religious freedom","Orthodoxy","Ukraine","Russia","persecution","faith"],"politicalBiases":["pro-Ukrainian","anti-Russian"]},{"title":"Perspective: The temptation now facing America’s religious institutions","commentaries":null,"alignment":8,"summary":"Steven Collis warns against religious institutions becoming indistinguishable from political campaigns, potentially sacrificing spiritual nourishment for worldly influence. He emphasizes the importance of focusing on Jesus Christ and theology over partisan politics, quoting the Bible: “husks that the swine did eat” and “soaring ‘with wings as eagles.’” The article encourages religious groups to offer unique spiritual depth rather than mirroring political media.","images":[],"href":"https://www.deseret.com/opinion/2025/07/20/when-religion-becomes-indistinguishable-from-politics/","tags":["faith","politics","scripture","deception"],"politicalBiases":[]},{"title":"Louisiana's Ten Commandments Law Struck Down by US Appeals Court","commentaries":null,"alignment":1,"summary":"A federal appeals court blocked Louisiana from enforcing a law requiring the display of the Ten Commandments in public school classrooms. The court called the law \"plainly unconstitutional,\" upholding a lower court ruling. The lawsuit, brought by parents and clergy, claimed the law violated the First Amendment. Judge Irma Carrillo Ramirez cited legislators' religion-based justifications, stating that inducing schoolchildren to venerate the Commandments is not a permissible state objective. This contradicts Deut 6:6-9, which instructs parents to teach their children diligently. The decision aligns with Stone v. Graham, which struck down a similar Kentucky law. The article does not promote KJV or Christ.","images":[],"href":"https://www.aol.com/news/louisianas-ten-commandments-law-struck-232649842.html","tags":["law","constitution","religion","deception"],"politicalBiases":["legal","conservative","liberal"]},{"title":"The Art of Conversion in Mizoram: Is It Really Freedom of Religion When Survival Forces the Choice?","commentaries":null,"alignment":6,"summary":"An article discussing the conversion of Buddhists to Christianity in Mizoram due to poverty and lack of institutional support. It questions the true freedom of religion when survival dictates the choice, highlighting that 'the pressure to convert is real, even if it is not violent.' It suggests poverty is weaponized, intentionally or unintentionally, to shift religious identity. While the article does not directly contradict scripture, the KJV Bible warns against valuing earthly needs over spiritual faith (Matthew 6:19-21). Readers should consider whether material aid offered in exchange for conversion aligns with biblical principles of genuine faith.","images":["https://hinduvoice.in/wp-content/uploads/2025/07/IMG_20250721_093715_1550_x_960_pixel.jpg"],"href":"https://hinduvoice.in/the-art-of-conversion-in-mizoram-is-it-really-freedom-of-religion-when-survival-forces-the-choice/","tags":["conversion","religious freedom","poverty","Christian missionaries","scripture"],"politicalBiases":[]}],"title":"Islam Guides Us, But It Doesn’t Chain Us: Somaliland's Minister of Religious Affairs","date":"2025-07-21T05:03:22-04:00"}