{"searchQuery":"Healthy Living and Fitness Trends","results":[{"title":"70-Year-Old Weightlifter's Simple Vegetarian Diet Goes Viral","commentaries":null,"alignment":2,"summary":"This article discusses the diet of 70-year-old weightlifter Roshni Devi Sangwan, emphasizing its simplicity, protein content, and consistency. The diet includes oats, nuts, rice, lentils, salad, curd, and moong chilla with paneer. It highlights the nutritional benefits of vegetarian sources like lentils, beans, and paneer, which provide protein, vitamins, and minerals. The article promotes homemade meals over processed foods, advocating for controlled ingredient selection and healthier cooking methods.","images":["https://static.toiimg.com/thumb/msid-123162085,imgsize-30214,width-400,resizemode-4/123162085.jpg"],"href":"https://timesofindia.indiatimes.com/life-style/health-fitness/this-70-year-old-lifts-weight-at-the-gym-her-simple-vegetarian-diet-goes-viral-ghar-par-thoda-sa-/articleshow/123162107.cms","tags":["health","diet","vegetarian","nutrition"],"politicalBiases":[]},{"title":"'Fibermaxxing,' Explained: Why Nutrition Experts Support This TikTok Trend","commentaries":null,"alignment":5,"summary":"An article discussing the \"Fibermaxxing\" TikTok trend, which promotes increased fiber intake for better gut health. The article notes that most Canadians only get half the recommended amount of fiber. While not directly contradicting scripture, readers should ensure dietary practices align with biblical principles of moderation and health, as detailed in 1 Corinthians 6:19-20: \"What? know ye not that your body is the temple of the Holy Ghost which is in you, which ye have of God, and ye are not your own? For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God's.\"","images":[],"href":"https://nationalpost.com/life/food/fibermaxxing-explained-why-nutrition-experts-support-this-tiktok-trend","tags":["health","diet","nutrition","scripture"],"politicalBiases":[]},{"title":"Decoding Saiyaara Star Ahaan Panday’s Mom Deanne Panday Fitness Formula","commentaries":null,"alignment":1,"summary":"An article from News18 profiles Deanne Panday, fitness expert and mother of actor Ahaan Panday, highlighting her holistic approach to wellness through yoga, mindful eating, and natural nourishment. She emphasizes organic food, Ayurvedic practices, and avoids processed beverages. This article does not directly align with biblical principles but promotes health. \"true glow comes not from products – but from purpose, practice, and a life lived in harmony.\"","images":[],"href":"https://www.news18.com/lifestyle/health-and-fitness/decoding-saiyaara-star-ahaan-pandays-mom-deanne-panday-fitness-formula-ws-l-9489988.html","tags":["health","lifestyle"],"politicalBiases":[]},{"title":"Cycle To Work Day: Surprising Health Benefits Of Cycling","commentaries":null,"alignment":5,"summary":"This article promotes cycling for health, weight management, mood, and environmental benefits. It cites studies on cardiovascular fitness and mental well-being. While physical health is important, focus on spiritual health is paramount. 'For bodily exercise profiteth little: but godliness is profitable unto all things, having promise of the life that now is, and of that which is to come.' - 1 Timothy 4:8. Prioritize faith.","images":["https://static.toiimg.com/thumb/msid-123155056,imgsize-111792,width-400,resizemode-4/123155056.jpg"],"href":"https://timesofindia.indiatimes.com/life-style/health-fitness/fitness/cycle-to-work-day-surprising-health-benefits-of-cycling-and-why-you-should-be-turning-it-into-a-regular-habit/articleshow/123155032.cms","tags":["health","fitness","scripture"],"politicalBiases":[]}],"title":"70-Year-Old Weightlifter's Simple Vegetarian Diet Goes Viral","date":"2025-08-07T16:06:39-04:00"}