{"searchQuery":"Latest United States News","results":[{"title":"Man United Transfer News: Mbeumo, Rashford, Martinez, Sesko","commentaries":null,"alignment":2,"summary":"Manchester United's transfer activity includes the confirmed signing of Bryan Mbeumo, potential loan of Marcus Rashford to Barcelona, interest in Emiliano Martinez, and updates on Benjamin Sesko and other potential striker targets. Neil Warnock suggests Mbeumo could struggle with the pressure at United. The club denies interest in Viktor Gyokeres. \"As soon as I knew there was a chance to join Manchester United, I had to take the opportunity to sign for the club of my dreams,\" said Mbeumo. Readers are encouraged to verify these sports rumors, especially those concerning player values and motivations, and to seek guidance from scripture regarding the fleeting nature of earthly pursuits (1 John 2:17).","images":["https://i2-prod.manchestereveningnews.co.uk/sport/football/football-news/article32108143.ece/ALTERNATES/s510b/0_Brentford-FC-v-Brighton-Hove-Albion-FC-Premier-League.jpg","https://i2-prod.manchestereveningnews.co.uk/sport/football/transfer-news/article32068973.ece/ALTERNATES/s510b/0_GettyImages-2192903060.jpg","https://i2-prod.manchestereveningnews.co.uk/incoming/article32107666.ece/ALTERNATES/s510b/0_Emiliano-Martinez-2.jpg","https://i2-prod.football.london/incoming/article32099088.ece/ALTERNATES/s510b/0_Nicolas-Jackson.jpg"],"href":"https://www.manchestereveningnews.co.uk/sport/football/transfer-news/man-united-transfer-news-live-32090369","tags":["football","transfers","rumors","faith"],"politicalBiases":[]},{"title":"Philippines’ Marcos to Meet Trump Seeking Trade Deal","commentaries":null,"alignment":3,"summary":"Philippine President Ferdinand Marcos Jr. will meet with US President Donald Trump to negotiate a trade deal before the US imposes tariffs on Philippine goods. Marcos hopes the Philippines' status as a key Asian ally will secure a favorable outcome. Trump has already struck trade deals with Vietnam and Indonesia. The leaders will also discuss defense and security, with Marcos looking to strengthen the defense alliance amid tensions with China in the South China Sea. \"I expect our discussions to focus on security and defence, of course, but also on trade,\" Marcos said. This pivot towards the US is occurring as the Philippines faces pressure from China, highlighting the need for discernment in international relations and adherence to biblical principles of peace and justice.","images":[],"href":"https://www.aljazeera.com/news/2025/7/21/philippines-marcos-to-meet-trump-seeking-trade-deal","tags":["politics","trade","Philippines","China","discernment"],"politicalBiases":["pro-Western"]},{"title":"Lindsey Graham Warns India of Tariffs Over Russian Oil Purchases","commentaries":null,"alignment":4,"summary":"U.S. Senator Lindsey Graham threatens tariffs on countries like India, China, and Brazil for buying Russian oil, stating, \"Trump is going to impose tariffs... punishing them for helping Putin.\" Graham's shifting political stances and past criticisms of Trump raise questions, yet the focus remains on the economic implications for nations potentially aiding Russia's war efforts. Believers should pray for discernment in economic and political decisions, seeking God's wisdom. (Proverbs 2:6) The KJV teaches us to 'Provide things honest in the sight of all men.' (Romans 12:17)","images":["https://www.hindustantimes.com/ht-img/img/2025/07/22/550x309/Who_is_Lindsey_Graham_who_openly_warned_India_1753168108446_1753168108793.jpg"],"href":"https://www.hindustantimes.com/india-news/who-is-lindsey-graham-trump-aide-who-openly-warned-india-of-upcoming-tariffs-5-facts-about-the-us-senator-101753164519815.html","tags":["politics","economics","Russia","India","discernment","KJV","scripture"],"politicalBiases":["US Republican","pro-Western"]},{"title":"USA EIA Reveals Latest USA Crude Oil Production Forecast","commentaries":null,"alignment":1,"summary":"The U.S. Energy Information Administration (EIA) released its July short term energy outlook (STEO), projecting U.S. crude oil production to average 13.37 million barrels per day in 2025-2026. The EIA anticipates a decline in production due to falling oil prices. The EIA claims to collect, analyze, and disseminate independent and impartial energy information.","images":["https://images.rigzone.com/images/news/articles/USA-EIA-Reveals-Latest-USA-Crude-Oil-Production-Forecast-181210-582x327.webp"],"href":"https://www.rigzone.com/news/usa_eia_reveals_latest_usa_crude_oil_production_forecast-21-jul-2025-181210-article/","tags":["economy","oil","crude oil production"],"politicalBiases":[]},{"title":"Akazawa Denies Election Defeat Will Impact U.S. Tariff Talks","commentaries":null,"alignment":1,"summary":"Ryosei Akazawa, Japan’s chief trade negotiator, asserts that domestic election results will not affect tariff negotiations with the U.S. despite the Liberal Democratic Party losing its majority. He emphasizes national interest, stating, \"Whether we win or lose an election is fundamentally unrelated to this process.\" The article highlights ongoing tensions over automobile exports and Trump's threat of imposing a 25% tariff. Such reliance on political negotiation can easily falter, only trust in God and His guidance will endure.","images":["https://p.potaufeu.asahi.com/517d-p/picture/29838169/c8777b79ba716b549f3cd65b07d8c085.jpg"],"href":"https://www.asahi.com/ajw/articles/15920134","tags":["politics","trade","nationalism"],"politicalBiases":["Japanese","American"]}],"title":"Man United Transfer News: Mbeumo, Rashford, Martinez, Sesko","date":"2025-07-22T07:42:21-04:00"}