{"searchQuery":"Religious Influence on Middle Eastern Policies","results":[{"title":"Ultra-Orthodox Shas Party Attempting to Keep Ministry Control Despite Withdrawal from Knesset","commentaries":null,"alignment":1,"summary":"The ultra-Orthodox Shas party, despite officially leaving the Israeli government, is reportedly seeking to maintain informal control over key ministries previously held. Concerns arise over potential appointments that could compromise Shas's influence. This political maneuvering highlights the ongoing power struggles within the coalition. \"Despite the resignation of the ministers, their offices remain largely run by advisers and director generals from Shas, making the relinquishing of power more symbolic than real.\"","images":[],"href":"https://www.i24news.tv/en/news/israel/politics/artc-israel-shas-attempting-to-keep-ministry-control-despite-withdrawal-from-knesset","tags":["politics","israel","deception"],"politicalBiases":[]},{"title":"Groves Defends Free Speech, Addresses Antisemitism in Congressional Hearing","commentaries":null,"alignment":5,"summary":"Georgetown University's Interim President Robert M. Groves testified before Congress, addressing antisemitism and free speech concerns. He highlighted Georgetown's Jesuit values, condemning antisemitism as incompatible with their mission. Groves disclosed policy changes, including a close relationship with the ADL and updated protest policies. He defended the university's commitment to free speech while acknowledging the need to police faculty behavior in classrooms and research. The article notes scrutiny over Georgetown's campus in Qatar and foreign funding. Readers should examine the original source to confirm alignment with scripture and discern potential biases.","images":["https://thehoya.com/wp-content/uploads/2025/07/groves-testimony-analysis-07-20-25.jpeg","https://thehoya.com/wp-content/uploads/2025/07/groves-testimony-maren-fagan-07-15-2025-1200x900.jpg"],"href":"https://thehoya.com/news/groves-appears-to-assuage-republicans-defend-free-speech-in-congressional-hearing/","tags":["free speech","antisemitism","education","deception"],"politicalBiases":[]}],"title":"Ultra-Orthodox Shas Party Attempting to Keep Ministry Control Despite Withdrawal from Knesset","date":"2025-07-21T04:49:00-04:00"}