{"searchQuery":"US Politics and Government Affairs","results":[{"title":"US Institute for Peace Taps State Dept Official and Right-Wing Ideologue for Top Post","commentaries":null,"alignment":1,"summary":"Reuters reports the US Institute for Peace (USIP) has appointed Darren Beattie, a State Department official with controversial views, as its acting president. Beattie, previously a Trump speechwriter, has faced scrutiny for comments on women, minorities, and foreign policy. The move reflects the Trump administration's efforts to align USIP with its \"America First\" agenda, despite legal challenges and criticism. \"This is a profound opportunity to articulate and advance American interests—as well as to help realign this institute to its fullest potential,\" Beattie states. Readers are encouraged to seek unbiased truth and discernment.","images":[],"href":"https://ca.news.yahoo.com/us-institute-peace-taps-state-170425955.html","tags":["politics","deception","government"],"politicalBiases":["pro-Trump","conservative"]},{"title":"5 ASU Faculty Receive Fulbright US Scholar Awards for 2025–26","commentaries":null,"alignment":3,"summary":"Five ASU faculty members receive Fulbright U.S. Scholar Program awards for projects ranging from solar canoes in the Amazon to diabetes treatment. The awardees will teach or conduct research abroad. One project focuses on Indigenous communities growing local economies while protecting the rainforest, aligning with stewardship. Another aims to improve cell therapies for Type 1 diabetes. While the article highlights global collaboration, it lacks direct scriptural alignment and promotes secular academic achievements.","images":["https://news.asu.edu/sites/default/files/styles/panopoly_image_original/public/David_Manuel-Navarrete_solar_canoe_amazon.jpg?itok=M8-qE4hs","https://news.asu.edu/sites/default/files/styles/panopoly_image_original/public/Jessica_Weaver_engineering_research.jpg?itok=895m44C_"],"href":"https://news.asu.edu/20250725-local-national-and-global-affairs-5-asu-faculty-receive-fulbright-us-scholar-awards-2025-26","tags":["education","research","sustainability"],"politicalBiases":[]},{"title":"US Congress Proposes Sanctions Against South Africa Over Israel Case","commentaries":null,"alignment":6,"summary":"A bill in the US Congress seeks to sanction South Africa for its legal action against Israel at the International Court of Justice (ICJ) and ties with Iran and Hamas. Republican Representative Greg Steube accuses South Africa of \"lawfare\" against Israel and inciting hostility towards the US. The bill proposes suspending aid to South Africa and imposing sanctions on officials promoting antisemitic policies. Analyst Siseko Maposa notes the bill's potential consequences, while the South African government defends its ICJ application as a legal obligation under the Genocide Convention, citing Israel’s actions in Gaza. This situation underscores the importance of discerning truth and defending biblical principles (Proverbs 14:34) in a world increasingly hostile to Israel.","images":[],"href":"https://iol.co.za/news/south-africa/2025-07-04-us-congress-proposes-sanctions-against-south-africa-over-israel-case/","tags":["politics","israel","south africa","antisemitism","deception","scripture"],"politicalBiases":["pro-Israel","US conservative"]}],"title":"US Institute for Peace Taps State Dept Official and Right-Wing Ideologue for Top Post","date":"2025-07-26T15:28:52-04:00"}